import random
print ('«адача-1')
list_1 = [16, -8, 3, 9, -25, 16, 4, -4]
list_2 = []
for a in list_1:
    if a > 0 and ((a)**.5) % 1 == 0:
        list_2.append(int(a**.5))
        print(list_2)
print ('')
print ('«адача-2')
data = '29.01.2019'
data_list = data.split('.')
months = {'01': '€нвар€', '02': 'феврал', '03': 'марта', '04': 'апрел€',
          '05': 'ма€', '06': 'июн€', '07': 'июл€', '08': 'августа',
          '09': 'сент€бр€', '10': 'окт€бр€  ',  '11': 'но€бр€',
          '12': 'декабр€',
          }
days = {'01': 'первое', '02': 'второе', '03': 'третье', '04': 'четвЄртое',
        '05': 'п€тое', '06': 'шестое', '07': 'седьмое', '08': 'восьмое',
        '09': 'дев€тое', '10': 'дес€тое', '11': 'одиннадцатое',
        '12': 'двенадцатое', '13': 'тринадцатое', '14': 'четырнадцатое',
        '15': 'п€тнадцатое', '16': 'шестнадцатое', '17': 'семнадцатое',
        '18': 'восемнадцатое', '19': 'дев€тнадцатое', '20': 'двадцатое',
        '21': 'двадцать первое', '22': 'двадцать второе',
        '23': 'двадцать третье', '24': 'двадцать четвЄртое',
        '25': 'двадцать п€тое', '26': 'двадцать шестое',
        '27': 'двадцать седьмое', '28': 'двадцать восьмое',
        '29': 'двадцать дев€тое', '30': 'тридцатое', '31': 'тридцать первое',
        }
for key in days:
    if data_list[0] == key:
        data_list[0] = days[key]
for key in months:
    if data_list[1] == key:
        data_list[1] = months[key]
    answer_data = data_list[0] + ' ' + data_list[1] + ' ' + data_list[2] +
    ' ' "года"
    print(answer_data)
print (' ')
print ('«адача-3')
n = int(input('введите количество случайных элементов в списке: '))
list_1 = []
for el in range(n):
    list_1.append(random.randint(-100, 100))
    print(list_1)
print('')
print('«адача-4')
list_1 = [1, 2, 3, 4, 5, 5, 4, 5, 6, 7, 8, 10, 10, -1, -2, -1]
print('Cписок произвольных целых чисел', list_1)
list_2 = []
for m in list_1:
    if list_1.count(m) == 1:
        list_2.append(m)
        print(list_2)
